{"ESS":{"title":" הכל כיף ומשחקים עד שמישהו מקבל מוטציה","links":[],"tags":["Hebrew"],"content":"על אסטרטגיות יציבות אבולוציונית\nהערה: זה הפוסט הראשון באתר זה, פשוט רציתי להתחיל להעלות דברים אז זה לא בהכך הכי מושקע בעולם.\nאסטרטגיה נקראת יציבה אבולוציונית אם לכל אסטרטגיה מעורבת x\\neq x^* קיים \\varepsilon_{0}&gt;0 כך שלכל 0&lt;\\varepsilon&lt;\\varepsilon_{0} מתקיים\n(1-\\varepsilon)u_{1}(x,x^{*})+\\varepsilon u_{1}(x,x^{*})&lt;(1-\\varepsilon)u_{1}(x^{*},x^{*})+\\varepsilon u_{1}(x^{*},x)\nאז בואו נפרק את ההגדרה הזו, קודם כל מה היא פונקציית ה u_{1} הזו?"},"index":{"title":"🍁 ברוכים הבאים לבלוג של נדבי","links":[],"tags":[],"content":"הי 👋, אני נדב פרי, סטודנט בן 18 לתואר במתמטיקה באוניברסיטה הפתוחה. \nלבלוג אין מטרה ספיציפת חוץ מלדבר על דברים שמעניינים אותי במתמטיקה ונושאים אחרים שנתקלתי בהם ויש לי חשק לשתף, בתקווה תמצאו כאן דברים מעניינים ותהנו לפחות קצת.\nבלוג זה לוקח הרבה השראה מהבלוג המדהים של גדי בשם לא מדוייק, תודה גדי 🐲."},"limit":{"title":"גבולות של סדרות בכמה דקות","links":[],"tags":[],"content":"הקדמה קצרה\nהגדרת \\varepsilon,N הייתה אולי הפעם הראשונה שקראתי הגדרה מתמטית, חשבתי לרגע, ואז אמרתי ”רגע, מה לעזאזל קראתי עכשיו?“ אבל ההגדרה והאינטואיציה מסביבה דווקא נחמדה ובתכלס לא כזו קשה להבנה.\nאם אתם בתחילת מסע האינפי שלכם ועדיין לא סגורים על הגדרה זו ומשמעותה אז הגעתם למקום הנכון, אם לא אז אני עדיין חושב שתהנו :).\nמטרת ההגדרה\nכשאחנו מסתכלים על סדרה כמו a_{n}=\\frac{1}{n} זה ברור לנו שהסדרה ”שואפת“ ל 0 ב“אינסוף“ כלומר אנחנו רואים שככל שנציב מספרים יותר ויותר ערכי הסדרה יהיו יותר ויותר קרובים ל 0\nהשאלה היא, איך נוכל להגדיר את האינטואיציה הזו של שאיפה בצורה מתמטית ריגורוזית?\nמשחק הגבול\nדמיינו משחק שמשוחק בין שני שחקנים, השחקן הראשון יקרא ”תלמיד“ והשחקן השני יקרא ”בוחן“.\nניקח סדרה כלשהיa_{n}, התלמיד חושב שהוא יודע לאן הסדרה מתקרבת באינסוף, נסמן את הגבול שהוא טוען ב L, כאת הבוחן כשמו הוא, מתחיל לבחון, איך הוא בוחן?\nהוא בוחר מספר גדול מאפס, ( נסמן מספר זה ב \\varepsilon ) נגיד\\varepsilon=\\frac{1}{2} ומבקש ממנו את הבקשה הבאה:\n\nתמצא לי מקום כלשהו בסדרה שהחל ממנו כל האיברים של הסדרה יותר נמצאים בין L-\\varepsilon ל L+\\varepsilon\n\nההגיון בבקשה זו מתברר כשמסתכלים על מה לא יכול להיות גבול, אם אתה יכול למצוא"}}