{"ESS":{"title":"הכל כיף ומשחקים עד שיש מוטציה","links":["ESS"],"tags":["Game_Theory","Nadav_Perry"],"content":"הערות\n\nזה הפוסט הראשון שלי וניסיתי לכתוב אותו מהר כי אני עסוק אז יש פה דברים לא מושלמים שבתקווה אתקן בעתיד, מצב שאני אני חושב שהפוסט במצב שכבר בסדר לפרסמו.\nברור שרשתות חברתיות לא באמת עובדות בדיוק כמו שאני מתאר פה, אני מפשט לצורך הדוגמא.\nלמדתי את הנושא ולקחתי דוגמאות מסויימות עם שינויים דרך הספר “תורת המשחקים” של שמואל זמיר, מיכאל משלר ואלון סולן אז תודה וקרדיט להם.\n\n🐈 האומן והגנב\nברשתות חברתיות כמו פייסבוק, טוויוטר, אינסטרגם וכו’, יש שני סוגים של יוצרי תוכן ה-”אומנים” שמשקיעים זמן ויוצרים תוכן מקורי ואיכותי, וה-”גנבים” שלוקחים תוכן שמישהו יצר ברגע שהוא העלה אותו, משנים טיפה את הכותרת לכותרת יותר מושכת ומעלים את זה, ובכך גונבים את כל הצפיות של היוצר הראשון.\nלשם הפשטות נסתכל על אינטרקציה ספציפית בין שני משתמשים, אם שניהם אומנים כל אחד יוצר את התוכן שלו ושניהם מקבלים כמות צפיות בסדר ביחס לכמות הזמן שלקח להם לכתוב את הפוסט שלהם נניח 4 (ביחידות מומצאות של כמות לזמן השקעה), אם משתמש אחד גנב והשני אומן, הגנב בקושי השקיע ומשיג כמות יחסית גדולה של צפיות בנוסף הוא הורס לאומן שגנב ממנו שהשקיע כמות זמן גדולה והרבה מהצפיות שלו נגנבו על ידי הגנב, נניח 8 צ”ל (צפיות לזמן) לגנב ו 2 צ”ל לאומן.\nלבסוף אם גנב פוגש גנב לאף אחד מהם לא ילך טוב, הם יקבלו טיפה צפיות אבל הם פשוט גונבים אחד מהשני כל הזמן בלי ליצור תוכן חדש ולכן כל אחד מהם יקבל צ”ל יחיד. (בהמשך הפוסט פשוט אגיד “נקודות” במקום צפיות לזמן, מטעמי נוחות)\nלהלן מטריצה שמייצגת את האינטרקציות שתיארתי:\n\\begin{pmatrix} \\text{ןמוא} &amp; \\text{בנג} &amp; \\star\\\\\n\\left(4,4\\right) &amp; \\left(2,8\\right) &amp; \\text{ןמוא}\\\\\n\\left(8,2\\right) &amp; \\left(1,1\\right) &amp; \\text{בנג}\n\\end{pmatrix}\nהערה: אם כל המשתמשים גונבים אז נהיה שווה (לא בהרבה אבל שווה) להיות אומן ואם כולם אומנים אז נהיה מאוד שווה לגנוב תוכן.\n💫אנשים הם מורכבים\nמשתמש לא חייב תמיד לגנוב תוכן או תמיד ליצור תוכן חדש, הוא יכול להיות משהו בן לבין, בכדי לתאר את זה, נתאר כל משתמש בעזרת הסתברות 0\\leq x\\leq1 כאשר x זו ההסתברות של משתמש ליצור תוכן בהיתקלות עם משתמש אחר ולכן ההסתברות שלו לגנוב היא 1-x.\nבנוסף נסתכל על המצב הנוכחי ברשת כלומר נגדיר שהמצב ברשת הוא כזה שב-”היתקלות” עם משתמש יש לו סיכוי 0\\leq y\\leq1 להתנהג כמו אומן ו 1-y להתנהג כמו גנב.\n⭐השאלה המתבקשת\nאם המצב הזה קורה במציאות האם אחרי כמות זמן מסויימת נגיע לשיווי משקל כלשהו שבו ההסתברות להיתקל באומן היא y^* ויש אסטרטגיה אופטימלית של המשתמשים שכולם עושים, כלומר כל משתמש יוצר x^* מהזמן וגונב בשאר.\nמסתבר שאפשר לענות על השאלה הזו בצורה מאוד טובה בעזרת מושג שנקרא “אסטרטגיה יציבה אבולוציונית” (evolutionarily stable strategy, ESS) המושג הזה מגיע מתחום נחמד במתמטיקה שימושית שנקרא “תורת המשחקים”, לאסטרטגיות יציבות אבולציונית יש שימושים מפתיעים בכלכלה, אקולוגיה התנהגותית ומדעי המדינה!\nאבל לדעתי מספיק להסתכל על זה פשוט בשביל המתמטיקה הקלילה והנחמדה.\n💥התחלת הפתרון\nנניח שמשתמש חדש נרשם לאתר וצריך להחליט באיזה אסטרטגיה הוא עומד להשתמש (תחשבו על המשתמש בתור מוטציה של האוכלוסיה אם נוח לכם, זה לא חובה)\n\\overset{\\text{םימדוק םישמתשמ}}{\\overbrace{\\begin{pmatrix}\\text{רצוי} &amp; \\text{בנג} &amp; \\star\\\\\n\\left(4,4\\right) &amp; \\left(2,8\\right) &amp; \\text{רצוי}\\\\\n\\left(8,2\\right) &amp; \\left(1,1\\right) &amp; \\text{בנג}\n\\end{pmatrix}}}\\text{ םישדח םימשרנ}\nבמצב שתיארנו משתמש שמשחק אסטרטגיה x (כלומר הוא אומן x מהזמן וגנב 1-x מהזמן) והמצב ברשת הוא כזה שנתקלים באסטרטגית האומן y מהזמן וגנב 1-y מהזמן.\nכדי למצוא את הנקודות שהמשתמש שלנו יקבל בממוצע נשים לב שאם הוא משחק אך ורק אומן (x=1) אז הוא יקבל בממוצע  a=4y+2(1-y) שהרי y מהזמן הוא יתקל באומן ושניהם יקבל 4 ו 1-y מהזמן יתקל בגנב ויקבל 2, מצד שני אם המשתמש משחק אומן (x=0) אז הוא יקבל b=8\\cdot y+1\\cdot\\left(1-y\\right) ולכן כאשר המתמש משחק x כלשהו הוא יקבל את a x מהזמן ואת b 1-y מהזמן כלומר אם נסמן את הנקודות שהשמתמש מקבל ב u(x,y) אז:\nu\\left(x,y\\right)=x\\left(a\\right)+\\left(1-x\\right)\\left(b\\right)\nכלומר:‎‎‎‎‎\n\nu\\left(x,y\\right)=x\\left(4y+2\\left(1-y\\right)\\right)+\\left(1-x\\right)\\left(8y+\\left(1-y\\right)\\right)\nבהמשך נקרא לפונקציה זו “פונקציית התשלום” שהרי היא מתארת כמה המשתמש מקבל.\nאוקי, אז שמנו כמה משוואות על הלוח, איך פונקציית התשלום הזו תעזור לנו לבדוק מה יהיה שיווי המשקל הזה?\nתחילה נעבור מלחשוב על x בתור שחקן יחיד ונעבור לחשוב עליו בתור גל חדש (אבל קטן מאוד) של משתמשים חדשים שנרשמים לרשת החברתית שלנו ועושים את הבחירה שלהם של איזה אסטרטגיה ישחקו.\n🎯שיווי המשקל\nתחילה יעזור לנו למצוא משהו שנקרא שיווי משקל (או שיווי משקל נאש) שיווי משקל הוא מצב שבו גם המשתמשים החדשים וגם שאר המשתמשים לא יכולים לשפר את כמות הנקודות שהם מקבלים בעזרת שינוי האסטרטגיה, מבחינה מתמטית, \\left(x^{\\ast},y^{\\ast}\\right) מהווה שיווי משקל אם לכל זוג אסטרטגיות x_{1},y_{1} (שונות מ x^{\\ast},y^{\\ast}) מתקיים:\nu\\left(x_{1},y^{\\ast}\\right)\\leq u\\left(x^{\\ast},y^{\\ast}\\right)\n\nכלומר לא שווה למשתמשים החדשים להחליף אסטרטגיה, וגם:\nu\\left(x^{\\ast},y_{1}\\right)\\leq u\\left(x^{\\ast},y^{\\ast}\\right)\n\n🐳מציאת שיווי המשקל ברשת שלנו\nנתחיל מלפשט את פונקציית התשלום שלנו, כדי לא לשעמם אותכם למוות עם כמה חישובים של כיתה ז’ אדלג ללאחר הפישוט\nu\\left(x,y\\right)=-5xy+x+7y+1\nנרשום מחדש בצורה הבא\n\\displaylines{u\\left(x,y\\right)\t=\\left(1-5y\\right)x+7y+1 \\cr =5\\left(\\frac{1}{5}-y\\right)x+7y+1}\nברור לנו שלא יתכן שיהיה שיווי משקל שבו אחת הקבוצות או שתיהן משחקות אך ורק גנב או אך ורק אומן (כי אם כל האוכלוסיה עושה משהו אחד שווה לעבור לעשות משהו אחר ואז זה לא שיווי משקל) אבל אם y\\neq \\frac{1}{5} או ש \\frac{1}{5} -y&lt;0 ואז המשתמשים החדשים יבחרו x=0 (רק גנב) כדי למקסם את כמות הנקודות שלהם או \\frac{1}{5} -y&gt;0 ואז המשתמשים החדשים יבחרו x=1 (רק אומן) ולכן הדרך היחידה שהמערכת תהיה בשיווי משקל היא y=\\frac{1}{5}  אבל רגע רגע, זוכרים את המטריצה שמתארת את המצב שלנו?\n\\begin{pmatrix} \\text{ןמוא} &amp; \\text{בנג} &amp; \\star\\\\\n\\left(4,4\\right) &amp; \\left(2,8\\right) &amp; \\text{ןמוא}\\\\\n\\left(8,2\\right) &amp; \\left(1,1\\right) &amp; \\text{בנג}\n\\end{pmatrix}\nהמשחק סימטרי!, מה זה אומר? שכמות הנקודות ששאר המשתמשים מקבלים (כלומר אלה שמשחקים y) נסמן את פונקציית התשלום שלהם u_{2}(x,y) מקיימת u\\left(x,y\\right)=u_{2}\\left(y,x\\right), במילים, ניתן לשנות את זהויות השחקנים מבלי לשנות את הרווח של האסטרטגיות שלהם.\nולכן מאותם שיקולים של לפני כמה שורות האסטרטגיה היחידה שהמשתמשים החדשים יכולים לשחק בשיווי משקל היא x=\\frac{1}{5}\n🧠 בעיה בשיווי המשקל\nלמרות ששיווי המשקל הוא רעיון מאוד שימושי הוא לא בהכרח עונה לבדו על השאלה שלנו, שימו לב לדוגמא הבאה, מהמשחק הפשוט ואהוב של אבן, נייר ומספריים, כאשר כל שחקן לשחק אבן נייר או מספריים או שילוב שלהם (כלומר חלק מהזמן מספריים בהסתברות מסויימת, חלק מהזמן נייר וחלק מהזמן אבן) שיווי המשקל היחיד במשחק הוא שכל אחד מהשחקנים משחק \\left( \\frac{1}{3}, \\frac{1}{3}, \\frac{1}{3} \\right) כלומר שליש מהזמן כל אחת מהאפשרויות. (ברור שאם אחד מהשחקנים יעדיף טיפה יותר אבן משאר האפשרויות השחקן השני פשוט תמיד יבחר נייר ואז בממוצע ינצח יותר) הבעיה היא שהאסטרטגיה הזו לא בדיוק יציבה כי יכול להגיע גל חדש קטן של שחקנים ולשחק רק אבן, שיביא אותה תוצאה כנגד שאר האנשים שמשחקים \\left( \\frac{1}{3}, \\frac{1}{3}, \\frac{1}{3} \\right), אבל השחקנים החדשים האלה יגרמו לאנשים לעבור לשחק יותר נייר מה שיגרום לאנשים לשחק יותר מספריים, ויווצר כמו מעין cycle של שינויים במה אנשים משחקים ( משהו בסגנון כזהרק שאחרי שהכל מספריים יכולה לצוץ אבן יחידה ואז ממשיכים).\nאז אם שיווי משקל לא מתאים לפתירת המצב שלנו איזה מושג כן מתאים?\n🥳אסטרטגיה יציבה אבולוציונית\nאסטרטגיה x^*  נקראת אסטרטגיה יציבה אבולוציונית אם לכל אסטרטגיה x\\neq x^* מתקיים אחד משני התנאים הבאים:\n\nא u\\left(x,x^{\\ast}\\right)&lt;u\\left(x^{\\ast},x^{\\ast}\\right)\nב u\\left(x,x^{\\ast}\\right)=u\\left(x^{\\ast},x^{\\ast}\\right) וגם u\\left(x,x\\right)&lt;u\\left(x^{\\ast},x\\right)\n\nהאינטואיציה מאחורי ההגדרה היא שאסטרטגיה יציבה אבולוציונית אם אחד מהשניים מהתקיים\n\nכל מוטציה שיכולה להיות תביא לתוצאות פחות טובות באינטרקציה עם המצב הנוכחי\nהמוטציה מקבלת אותן תוצאות כמו המצב הנוכחי אבל האינטרקציה של המוטציה עם עצמה מביאה פחות נקודות מהאינטרקציה של המוטציה עם המצב הנוכיח (כלומר הומטציה לא תתפשט כי תגדל טיפה ואז תתחיל להיתקל בעצמה ואז בממוצע היא מקבלת פחות ממה שהאסטרטגיה הדומיננטית מקבלת ולכן לא תשרוד).\n\n😎סוף סוף\nלאחר ה side quest הקצר הזה על ההבדל בין יציבות אבולוציונית לשיווי משקל נחזור לבעיה המקורית שלנו ונבדוק האם שיווי המשקל שמצאנו הוא אסטרטגיה יציבה אבולוציונית, שיווי המשקל שמצאנו ב 🐳מציאת שיווי המשקל ברשת שלנו  הוא \\left( \\frac{1}{5}, \\frac{1}{5} \\right), האם שיווי משקל זה גם יציב אבולוציונית?\nהתשוב היא כן, לפי התנאי השני:\nלכל x\\neq \\frac{1}{5}\nu\\left(x,\\frac{1}{5}\\right)=5\\left(\\frac{1}{5}-\\frac{1}{5}\\right)x+7\\cdot\\frac{1}{5}+1=\\frac{7}{5}+1=u\\left(\\frac{1}{5},\\frac{1}{5}\\right)\nוהכי חשוב, האי שיוויון u\\left(x,x\\right)&lt;u\\left(x^{\\ast},x\\right) כלומר:\n\\displaylines{5\\left(\\frac{1}{5}-x\\right)x+\\cancel{7x}+\\cancel{1}&amp;&lt;5\\left(\\frac{1}{5}-x\\right)\\frac{1}{5}+\\cancel{7x}+\\cancel{1} \\cr x-5x^{2}&lt;\\frac{1}{5}-x \\cr 0&lt;\\frac{1}{5}-2x+5x^{2} \\cr 0&lt;\\left(5x-1\\right)^{2}}\nוזה מתקיים לכל x\\neq\\frac{1}{5} כלומר מתקיים התנאי השני שלנו ולכן האסטרטגיה יציבה אבולוציונית, יאי🎉!\nלסיכום השאלה שלנו אכן יש מצב של שיווי משקל טבעי בין גנבים לאומנים והוא שכל משתמש יגנוב \\frac{4}{5} ויצור דברים חדשים \\frac{1}{5} מהזמן.\n\nכמה הערות על הקשרים בין יציבות אבולוציונית לשיווי משקל נאש כדי לתת לכם טיפה תיאבון (ללא הוכחה)\n\nבמשחק סימטרי של שני שחקנים (כמו שהיה לנו פה) אם x^* יציבה אבולוציונית אז (x^*,x^*) שיווי משקל נאש.\nמשפט חשוב בתורת המשחקים (אולי אעשה עליו פוסט בעתיד) נקרא משפט נאש מבטיח קיום של שיווי משקל במה שנקרא אסרטגיות מעורבות, כלומר כאשר אפשר לבחור אסטרטגיות בהסתברויות כלשהן (כמו שעשינו פה) לעומת זאת לא בכל משחק יש אסטרטגיה יציבה אבולוציונית.\n"},"index":{"title":"🍁 ברוכים הבאים לבלוג של נדבי","links":["ESS"],"tags":[],"content":"הי 👋, אני נדב פרי, סטודנט בן 18 לתואר במתמטיקה באוניברסיטה הפתוחה. \nלבלוג אין מטרה ספיציפת חוץ מלדבר על דברים שמעניינים אותי במתמטיקה ונושאים אחרים שנתקלתי בהם ויש לי חשק לשתף, בתקווה תמצאו כאן דברים מעניינים ותהנו לפחות קצת.\nבלוג זה לוקח הרבה השראה מהבלוג המדהים של גדי בשם לא מדוייק, תודה גדי 🐲.\n\nאתם מוזמנים לקרוא את הפוסט הראשון שלי: יציבות אבולוציונית ופייסבוק"}}